/*Завдання на сьогодні : 1) Ввести матрицю дійсних чисел розміром mxn
2) Видрукувати всі елементи в фоматі матриці 
3) видрукувати стовпчики матриці з непарними номерами 
4) видрукувати всі діагональні елементи 
5) знайти і видрукувати найменший елемент в кожному рядку 
6) поміняти місцями значення k-ого та l-ого рядка (k,l вводимо) 
7) порахувати скільки є таких стовпців, в  яких елементи спадають*/

#include <iostream>

using namespace std;
int main() {
	cout << "enter array" << endl;
	
	for (int i = 0; i < n - 1; i++) {
		for (int j = 0; j < m - 1; j++) {
			cout << array[n, m];
		}
	}


	return 0;
}